Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33f/h/p33FJ256MC710A.h
#define _IPC14_PWMIP0_POSITION                   0x00000004
#define _IPC14_PWMIP0_MASK                       0x00000010
#define _IPC14_PWMIP0_LENGTH                     0x00000001

#define _IPC14_PWMIP1_POSITION                   0x00000005
#define _IPC14_PWMIP1_MASK                       0x00000020
#define _IPC14_PWMIP1_LENGTH                     0x00000001

#define _IPC14_PWMIP2_POSITION                   0x00000006
#define _IPC14_PWMIP2_MASK                       0x00000040
#define _IPC14_PWMIP2_LENGTH                     0x00000001

#define _IPC14_QEIIP0_POSITION                   0x00000008
#define _IPC14_QEIIP0_MASK                       0x00000100
#define _IPC14_QEIIP0_LENGTH                     0x00000001

#define _IPC14_QEIIP1_POSITION                   0x00000009
#define _IPC14_QEIIP1_MASK                       0x00000200
#define _IPC14_QEIIP1_LENGTH                     0x00000001

#define _IPC14_QEIIP2_POSITION                   0x0000000A
#define _IPC14_QEIIP2_MASK                       0x00000400
#define _IPC14_QEIIP2_LENGTH                     0x00000001

#define _IPC15_DMA5IP_POSITION                   0x00000004
#define _IPC15_DMA5IP_MASK                       0x00000070
#define _IPC15_DMA5IP_LENGTH                     0x00000003

#define _IPC15_FLTAIP_POSITION                   0x0000000C
#define _IPC15_FLTAIP_MASK                       0x00007000
#define _IPC15_FLTAIP_LENGTH                     0x00000003

#define _IPC15_DMA5IP0_POSITION                  0x00000004
#define _IPC15_DMA5IP0_MASK                      0x00000010
#define _IPC15_DMA5IP0_LENGTH                    0x00000001

#define _IPC15_DMA5IP1_POSITION                  0x00000005
#define _IPC15_DMA5IP1_MASK                      0x00000020
#define _IPC15_DMA5IP1_LENGTH                    0x00000001

#define _IPC15_DMA5IP2_POSITION                  0x00000006
#define _IPC15_DMA5IP2_MASK                      0x00000040
#define _IPC15_DMA5IP2_LENGTH                    0x00000001

#define _IPC15_FLTAIP0_POSITION                  0x0000000C
#define _IPC15_FLTAIP0_MASK                      0x00001000
#define _IPC15_FLTAIP0_LENGTH                    0x00000001

#define _IPC15_FLTAIP1_POSITION                  0x0000000D
#define _IPC15_FLTAIP1_MASK                      0x00002000
#define _IPC15_FLTAIP1_LENGTH                    0x00000001

#define _IPC15_FLTAIP2_POSITION                  0x0000000E
#define _IPC15_FLTAIP2_MASK                      0x00004000
#define _IPC15_FLTAIP2_LENGTH                    0x00000001

#define _IPC16_FLTBIP_POSITION                   0x00000000
#define _IPC16_FLTBIP_MASK                       0x00000007
#define _IPC16_FLTBIP_LENGTH                     0x00000003

#define _IPC16_U1EIP_POSITION                    0x00000004
#define _IPC16_U1EIP_MASK                        0x00000070
#define _IPC16_U1EIP_LENGTH                      0x00000003

#define _IPC16_U2EIP_POSITION                    0x00000008
#define _IPC16_U2EIP_MASK                        0x00000700
#define _IPC16_U2EIP_LENGTH                      0x00000003

#define _IPC16_FLTBIP0_POSITION                  0x00000000
#define _IPC16_FLTBIP0_MASK                      0x00000001
#define _IPC16_FLTBIP0_LENGTH                    0x00000001

#define _IPC16_FLTBIP1_POSITION                  0x00000001
#define _IPC16_FLTBIP1_MASK                      0x00000002
#define _IPC16_FLTBIP1_LENGTH                    0x00000001

#define _IPC16_FLTBIP2_POSITION                  0x00000002
#define _IPC16_FLTBIP2_MASK                      0x00000004
#define _IPC16_FLTBIP2_LENGTH                    0x00000001

#define _IPC16_U1EIP0_POSITION                   0x00000004
#define _IPC16_U1EIP0_MASK                       0x00000010
#define _IPC16_U1EIP0_LENGTH                     0x00000001

#define _IPC16_U1EIP1_POSITION                   0x00000005
#define _IPC16_U1EIP1_MASK                       0x00000020
#define _IPC16_U1EIP1_LENGTH                     0x00000001

#define _IPC16_U1EIP2_POSITION                   0x00000006
#define _IPC16_U1EIP2_MASK                       0x00000040
#define _IPC16_U1EIP2_LENGTH                     0x00000001

#define _IPC16_U2EIP0_POSITION                   0x00000008
#define _IPC16_U2EIP0_MASK                       0x00000100
#define _IPC16_U2EIP0_LENGTH                     0x00000001

#define _IPC16_U2EIP1_POSITION                   0x00000009
#define _IPC16_U2EIP1_MASK                       0x00000200
#define _IPC16_U2EIP1_LENGTH                     0x00000001

#define _IPC16_U2EIP2_POSITION                   0x0000000A
#define _IPC16_U2EIP2_MASK                       0x00000400
#define _IPC16_U2EIP2_LENGTH                     0x00000001

#define _IPC17_DMA6IP_POSITION                   0x00000000
#define _IPC17_DMA6IP_MASK                       0x00000007
#define _IPC17_DMA6IP_LENGTH                     0x00000003

#define _IPC17_DMA7IP_POSITION                   0x00000004
#define _IPC17_DMA7IP_MASK                       0x00000070
#define _IPC17_DMA7IP_LENGTH                     0x00000003

#define _IPC17_C1TXIP_POSITION                   0x00000008
#define _IPC17_C1TXIP_MASK                       0x00000700
#define _IPC17_C1TXIP_LENGTH                     0x00000003

#define _IPC17_C2TXIP_POSITION                   0x0000000C
#define _IPC17_C2TXIP_MASK                       0x00007000
#define _IPC17_C2TXIP_LENGTH                     0x00000003

#define _IPC17_DMA6IP0_POSITION                  0x00000000
#define _IPC17_DMA6IP0_MASK                      0x00000001
#define _IPC17_DMA6IP0_LENGTH                    0x00000001

#define _IPC17_DMA6IP1_POSITION                  0x00000001
#define _IPC17_DMA6IP1_MASK                      0x00000002
#define _IPC17_DMA6IP1_LENGTH                    0x00000001

#define _IPC17_DMA6IP2_POSITION                  0x00000002
#define _IPC17_DMA6IP2_MASK                      0x00000004
#define _IPC17_DMA6IP2_LENGTH                    0x00000001

#define _IPC17_DMA7IP0_POSITION                  0x00000004
#define _IPC17_DMA7IP0_MASK                      0x00000010
#define _IPC17_DMA7IP0_LENGTH                    0x00000001

#define _IPC17_DMA7IP1_POSITION                  0x00000005
#define _IPC17_DMA7IP1_MASK                      0x00000020
#define _IPC17_DMA7IP1_LENGTH                    0x00000001

